# Задача 1
# Строка представляет собой арифметическое выражение из 
# однозначных чисел и знаков + и -. Вычислите результат.
# Пример^
# Ввод
# 8-5+2-1
# Вывод
# 4

""" some_list = input("Введите арифметическое выражение: ")
print(some_list)
print(eval(some_list)) """


# НЕОБЯЗАТЕЛЬНЫЕ

# Задача 26:  
# Напишите программу, которая на вход принимает два числа A и B, 
# и возводит число А в целую степень B с помощью рекурсии.
# *Пример:*
# A = 3; B = 5 -> 243 (3⁵)
#     A = 2; B = 3 -> 8 

""" def number(a, b):
    if b == 0:
        return 1
    return (a ** b)

print(number(3, 5)) """


